frontend/controllers/CustomerController.php

	private function store(Customer $customer) {
		$customer_record = new CustomerRecord();
		$customer_record->name = $customer->name;
		$customer_record->birth_date = $customer->birth_date->format('Y-m-d');
		$customer_record->notes = $customer->notes;
		$customer_record->save();

		foreach ($customer->phones as $phone) {
			$phone_record = new PhoneRecord();
			$phone_record->number = $phone->number;
			$phone_record->customer_id = $customer_record->id;
			$phone_record->save();
---
INSERT INTO `customer` (`name`, `birth_date`, `notes`) VALUES ('h', '1999-06-22', 'sdf')
INSERT INTO `phone` (`number`, `customer_id`) VALUES ('12', 5)